{
    "version": "https://jsonfeed.org/version/1",
    "title": "Jugal Kishore",
    "description": "",
    "home_page_url": "https://devjugal.com",
    "feed_url": "https://devjugal.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Jugal Kishore"
    },
    "items": [
        {
            "id": "https://devjugal.com/story-behind-my-username-crazyuploader/",
            "url": "https://devjugal.com/story-behind-my-username-crazyuploader/",
            "title": "The Story Behind the Username &quot;crazyuploader&quot; — Embracing the Power of Uploads",
            "summary": "If you know me well, I mostly go with the username \"crazyuploader\" wherever I can, be it GitHub, or Telegram,&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">If you know me well, I mostly go with the username </span><i><span style=\"font-weight: 400;\">\"crazyuploader\"</span></i><span style=\"font-weight: 400;\"> wherever I can, be it GitHub, or Telegram, etc. One might wonder what's the story behind the username? Is this person genuinely crazy, or just they upload a lot of stuff?</span></p>\n<p><span style=\"font-weight: 400;\">Well, the truth behind that username is that it indeed has to do with uploading which I used to do in the past, but not in the way you might think!</span></p>\n<p><span style=\"font-weight: 400;\">The story goes all back to school days, when fast fiber internet was not that common and something out of reach for this peasant. In school computer labs though, we had internet on every computer as long as the D-Link Switch was on. Mentioning this because at times the Switch would be turned off. </span></p>\n<p><span style=\"font-weight: 400;\">Being a tech enthusiast I always had this in me to check out the latest gadgets, phones’ reviews on YouTube, and that wouldn’t be possible with me having just 2G/3G mobile data which was very expensive back in those days.</span></p>\n<p><span style=\"font-weight: 400;\">So basically I used to download such YouTube videos in computer labs, and copy them to my pen drive before leaving the computer lab. Using my 3G mobile data I’d hardly get 300-400 KB/s, and the data was pretty much limited, hardly 1 GB for a month! Whereas I was getting 2-3 MB/s in the computer lab; it wasn’t any ADSL connection, it was a fiber-optic network after all.</span></p>\n<p><span style=\"font-weight: 400;\">Now, sooner or later, I would want to download more than just YouTube videos, such as software and their big setups which would be very hard for me to download on very limited mobile data. One peculiar thing I realized while downloading stuff from <a href=\"https://filehippo.com\" target=\"_blank\" rel=\"noopener\">Filehippo.com</a> was that it would only give 700-800 KB/s, much less than downloading YouTube videos. And we students would often blow the FUP (Fair Use Policy) limits, that would further reduce speeds.</span></p>\n<p><span style=\"font-weight: 400;\">To tackle this, I got an idea, since YouTube is owned by Google, I thought of trying downloading something from Google Drive, see if it is as fast as YouTube, and voila it was fast, whatever I could download through Google websites were very fast, speeds always in MegaBytes!</span></p>\n<p><span style=\"font-weight: 400;\">This led to me searching for ways to put stuff in Google Drive so that I could download using Google Drive in the computer lab, which was not restricted as long as speeds were concerned. Came across few websites that had free service to upload to Google Drive using direct links; URLs of files. I hoped on one such website, created a dummy Google account for privacy purposes, also because my primary Google account had 2FA on. Tried uploading to Google Drive using direct links of files from <a href=\"https://filehippo.com\" target=\"_blank\" rel=\"noopener\">Filehippo.com</a>, and it worked!</span></p>\n<p><span style=\"font-weight: 400;\">All that was left for me to try was to check whether I can get full speed in the computer lab, and guess what? I was able to get full speed while downloading softwares and stuff, which I actually had to upload first, and that is for me to download something, I needed to upload first to Google Drive, and hence the username </span><i><span style=\"font-weight: 400;\">“crazyuploader”</span></i><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">This uploading and downloading went for months, and I truly found the internet in the computer lab useful, made most of it. Though, I guess it’s not something I could proudly tell everyone back then, secretive stuff.</span></p>\n<p><span style=\"font-weight: 400;\">And there it goes, the story behind my username. This is my first blog post that I am writing. I don't know how to write a blog though, but I gotta try! </span></p>\n<p><span style=\"font-weight: 400;\">Anyways, thanks for reading, ciao.</span></p>",
            "image": "https://devjugal.com/media/posts/4/thomas-jensen-qTEj-KMMq_Q-unsplash.jpg",
            "author": {
                "name": "Jugal Kishore"
            },
            "tags": [
                   "UsernameStory",
                   "SharingExperiences",
                   "SchoolDays",
                   "GoogleDriveHacks",
                   "CrazyUploader"
            ],
            "date_published": "2023-05-07T12:31:44+05:30",
            "date_modified": "2023-10-30T16:11:01+05:30"
        }
    ]
}
