{
    "version": "https://jsonfeed.org/version/1",
    "title": "Jugal Kishore",
    "description": "",
    "home_page_url": "https://blog.devjugal.com",
    "feed_url": "https://blog.devjugal.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Jugal Kishore"
    },
    "items": [
        {
            "id": "https://blog.devjugal.com/story-behind-my-username-crazyuploader/",
            "url": "https://blog.devjugal.com/story-behind-my-username-crazyuploader/",
            "title": "The Story Behind the Username &quot;crazyuploader&quot;: Embracing the Power of Uploads",
            "summary": "Introduction: Whenever you come across my online presence, you'll likely find me using the username \"crazyuploader\". Intriguing, isn't it? You might wonder if I'm genuinely crazy or simply someone who uploads a lot of content. Today, I'll reveal the truth behind this username, which indeed&hellip;",
            "content_html": "<p><strong>Introduction:</strong><br>Whenever you come across my online presence, you'll likely find me using the username <em>\"crazyuploader\"</em>. Intriguing, isn't it? You might wonder if I'm genuinely crazy or simply someone who uploads a lot of content. Today, I'll reveal the truth behind this username, which indeed relates to uploading, but in a rather unexpected way.<br><br><strong>Unveiling the School Days:</strong><br>Let's travel back to my school days, a time when lightning-fast fiber internet was a luxury beyond my reach. However, our school computer labs had internet access on every computer, granted that the D-Link Switch was turned on. Being a tech enthusiast, I had an insatiable curiosity to explore the latest gadgets and watch YouTube reviews. Unfortunately, with only expensive 2G/3G mobile data at my disposal, fulfilling this passion seemed impossible.<br><br><strong>A Clever Solution:</strong><br>Determined to overcome this challenge, I devised a strategy. I began downloading YouTube videos in the computer labs and saving them to my pen drive before leaving. Compared to the meager 300-400 KB/s I obtained with my 3G mobile data, the computer lab's fiber connection provided speeds of 2-3 MB/s, a significant difference.<br><br><strong>Expanding Horizons:</strong><br>As time passed, my thirst for downloads grew beyond YouTube videos. I desired software and large setups, which proved arduous to obtain using my mobile data. While downloading from platforms like https://filehippo.com, I noticed the speeds were disappointingly limited to 700-800 KB/s, much slower than YouTube videos. Moreover, we often surpassed the fair usage policy limits imposed by our service providers, leading to further speed reductions.<br><br><strong>An Unexpected Discovery:</strong><br>In my quest for a solution, I stumbled upon an ingenious idea. Since YouTube is owned by Google, I speculated that downloading from Google Drive might yield faster results. As it turned out, my assumption was correct. Whatever I downloaded through Google websites provided remarkable speeds, consistently measured in megabytes.<br><br><strong>Exploring New Avenues:</strong><br>Fuelled by this newfound discovery, I delved deeper into finding ways to leverage Google Drive for downloads in the school computer lab, where speed restrictions were less stringent. At the time, certain websites offered free services that allowed users to upload files to Google Drive using direct links or URLs. Utilizing one of these platforms, I created a dummy Google account for privacy reasons and successfully uploaded files from FileHippo using the direct links.<br><br><strong>The Birth of \"crazyuploader\":</strong><br>Having overcome numerous hurdles, I was left with one final test—to ascertain whether I could achieve full speed in the computer lab. And lo and behold, I succeeded! I attained maximum speeds while downloading software and other files, which I had to upload first. Thus, the name <em>\"crazyuploader\"</em> was born—a tribute to my unique method of ensuring I could download by first uploading to Google Drive.<br><br><strong>A New Journey Begins:</strong><br>As I embark on this new venture of blogging, I admit that I am a novice in this realm. Nevertheless, I'm eager to share my experiences, ideas, and discoveries with you all. This marks my very first blog post, and although I lack expertise in blog writing, I'm determined to give it a try!<br><br><strong>Conclusion:</strong><br>The story behind the username <em>\"crazyuploader\"</em> unravels the resourcefulness born out of necessity. Overcoming the limitations of slow mobile data and restricted internet speeds, I found a clever way to utilize the power of Google Drive for faster downloads. As I venture into the world of blogging, I embrace the excitement of sharing my journey and insights, even as I navigate this new territory. Stay tuned for more stories, discoveries, and the occasional life updates.</p>",
            "image": "https://blog.devjugal.com/media/posts/4/thomas-jensen-qTEj-KMMq_Q-unsplash.jpg",
            "author": {
                "name": "Jugal Kishore"
            },
            "tags": [
                   "UsernameStory",
                   "SharingExperiences",
                   "SchoolDays",
                   "GoogleDriveHacks",
                   "FirstBlogPost",
                   "CrazyUploader"
            ],
            "date_published": "2023-05-07T12:31:44+05:30",
            "date_modified": "2023-05-16T15:22:19+05:30"
        },
        {
            "id": "https://blog.devjugal.com/first-post/",
            "url": "https://blog.devjugal.com/first-post/",
            "title": "First Post",
            "summary": "First Post ;p",
            "content_html": "<article>\n<div class=\"post-excerpt\"><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">First Post ;p</span></div>\n</article>",
            "author": {
                "name": "Jugal Kishore"
            },
            "tags": [
            ],
            "date_published": "2022-12-18T23:34:56+05:30",
            "date_modified": "2023-05-07T15:04:06+05:30"
        }
    ]
}
